{
    "id": "62983277-e9fe-45a0-942c-5e69e04f077b",
    "externalId": "a9YF_xhEvTw",
    "name": "🔴 LIVE: Rubble's Animal Rescues! 🐯 w/ PAW Patrol Marshall, Chase & Skye! | Rubble & Crew",
    "description": "Whenever someone needs help, they can yelp! And the same goes for animals that need the PAW Patrol! Rubble gets help from Skye, Marshall, Zuma, Chase, Rocky and Ryder to rescue animals in Adventure Bay!\n\n#PAWPatrol #RubbleAndCrew #PAWPatrol Rubble\n\nGet ready to wreck and roll with Rubble & Crew as they build a playground for the kids of Builder Cove and find more construction solutions! Watch this marathon with Rubble, Charger, Mix, Wheeler, Motor, Auntie Crane, and Grandpa!\n\n#Rubble #RubbleAndCrew #PAWPatrol #PAWPatrolRubble #NickJr \n\nRescue Knight Rubble is ready for action in Barkingburg with the help of PAW Patrol Marshall, Chase, Skye, and more pups! Watch this 24/7 livestream marathon to see if the pups can stop Claw and his dragon and rescue baby dragons!\n\n#RubbleAndCrew #Rubble #PAWPatrolRubble #PAWPatrol #NickJr\n\nSubscribe to the NEW Rubble & Crew YouTube Channel! https://at.nick.com/RubbleAndCrewSubscribe\nNEW Rubble videos! https://at.nick.com/NEWRubbleVideos\nRubble & Crew videos! https://at.nick.com/RubbleAndCrewVideos\nWatch more Rubble videos https://at.nick.com/RubbleAndCrewYT\n\n► Nick Jr. on YouTube https://at.nick.com/NickJrYouTube\n► Blue’s Clues & You! on YouTube https://at.nick.com/BCYYouTube\n► Blaze and the Monster Machines on YouTube: https://at.nick.com/BMMYouTube\n\nRubble on the double! No construction job is too big for PAW Patrol pup Rubble. You can watch Rubble & Crew, a brand-new animated PAW Patrol spinoff centered around fan-favorite character Rubble on Nickelodeon! Watch Rubble get the job done with the help of his family including Mix, Charger, Wheeler, Motor, Grandpa, and Auntie Crane! \n\nPlus, you can catch members of the PAW Patrol like Chase, Marshall, Skye, Rocky, Zuma, Everest, Tracker, Rex, Liberty, Al, and more! Anything is paw-sible so join Rubble in these construction rescues and adventures!",
    "url": "",
    "publishedAt": "2023-06-30T21:45:57.000+00:00",
    "endedAt": null,
    "streamer": {
        "id": "ed4682c3-609c-4474-a17b-2fe3de81e3bc",
        "externalId": "UCMPKq9xxIiAtfkOFW8gYwNw",
        "name": "NickJR",
        "url": "https://www.youtube.com/@nickjr",
        "platform": "YOUTUBE"
    }
}