{
    "page": 0,
    "size": 20,
    "totalPages": 1,
    "totalItems": 1,
    "items": [
        {
            "id": "6001270f-7693-450b-ba6f-f6c5317acf79",
            "externalId": "oVcIz3uRKjw",
            "name": "🔴 REAL FORTNITE FASHION SHOW LIVE! SKIN CONTEST! CUSTOM MATCHMAKING | FORTNITE LIVE STREAM!",
            "donateService": {
                "id": "778721bf-cf09-4a7d-be01-00a5426a1502",
                "name": "StreamLabs",
                "prefixes": [
                    "https://streamlabs.com"
                ]
            },
            "description": "Fortnite Fashion Show Live\n\nSecond Channel: https://youtube.com/channel/UC5-1uhpoIRu33dJ_K_MN_bQ\n\nBecome a MEMBER: https://www.youtube.com/channel/UCkZ-B5T8zxiMkVJwqV0KaFQ/join\nDonate: https://streamlabs.com/TeamSaGe\n\nInstagram: https://instagram.com/Team_SaGeYT\n\nTags: #fortnitelive #fortnitetopic #fashionshow #fortnitefashionshowlive\n\nRelated topics: fortnite fashion show live, fashion show fortnite live, live fortnite fashion show, fortnite live, live fortnite, skin contest live, fortnite live fashion show, live fashion shows, live fashion show fortnite, fortnite fashion show, fashion show live, fortnite live stream, fashion shows fortnite live, live fashion show, fortnite customs live, fashion show, custom matchmaking fortnite, custom games fortnite live, fortnite skin contest live, fashion shows live, fortnite fashion shows live, fashion shows, fashion show fortnite, customs fortnite live, fortnite fashion show live na east, fortnite fashion show live na west, fortnite fashion show live eu, duo fashion show fortnite live, squads fashion show fortnite live\n\nfortnite battle royale, fortnite season 2, fortnite chapter 4, fortnite item shop, fortnite arena live, fortnite item shop live, fortnite update, fortnite fashion show live europe, fortnite fashion show live squads, nae east fortnite fashion show live, na east fortnite fashion shows live, na west fortnite fashion shows live, fortnite event, oce fortnite fashion shows live, oceania fortnite fashion shows live, middle east fortnite fashion shows live, asia fortnite fashion shows live, fortnite gifting live, fortnite gameplay, fortnite playing with viewers, skin contest live\n\nDISCLAIMER: The stream broadcasted here is a replay of one of my past streams and is for entertainment purposes only. You are not required to like, subscribe or turn on notifications. It's only a recommendation. Thank you for watching and have a great day!",
            "url": "https://youtube.com/watch?v=oVcIz3uRKjw",
            "publishedAt": "2023-07-16T11:14:33.000+00:00",
            "endedAt": null,
            "streamer": {
                "id": "9d99122b-1617-4d15-8df5-af200edf0315",
                "externalId": "UCkZ-B5T8zxiMkVJwqV0KaFQ",
                "name": "TeamSage",
                "url": "https://www.youtube.com/@TeamSaGeYT",
                "platform": "YOUTUBE",
                "streamsRatio": 0.008219178082191782,
                "partner": false,
                "favourite": false
            },
            "descriptionLinks": [
                "https://youtube.com/channel/UC5-1uhpoIRu33dJ_K_MN_bQ",
                "https://www.youtube.com/channel/UCkZ-B5T8zxiMkVJwqV0KaFQ/join",
                "https://streamlabs.com/TeamSaGe",
                "https://instagram.com/Team_SaGeYT"
            ]
        }
    ]
}